Tekla Open API Reference for Tekla Structures 2025
RebarLegFace.Contour Property
 Gets or sets the outer Contour of the rebar leg face.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Contour Contour { get; set; }
Public Property Contour As Contour
	Get
	Set
Property Value
Type: Contour
See Also
Reference
RebarLegFace Class
Tekla.Structures.Model Namespace